---
kind: method
id: M:Autodesk.Revit.DB.ElementArray.Insert(Autodesk.Revit.DB.Element,System.Int32)
source: html/8cf5a3b5-2bce-d245-6119-60e33f711fba.htm
---
# Autodesk.Revit.DB.ElementArray.Insert Method

Insert the specified element into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	Element item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Element`) - The element to be inserted into the array.
- **index** (`System.Int32`) - The element will be inserted before this index.

## Returns
Returns whether the element was inserted into the array.